{"pageProps":{"notes":[{"slug":"scanning-film-with-a-digital-camera","title":"Scanning film with a digital camera","date":"2022-07-07T16:30:17.316Z","cover":null,"metaImage":"/content/scanning-film-with-a-digital-camera/scan_3.jpeg","excerpt":"<p>In this day and age, if you are a film shooter, you know that digitalizing film is inevitable. Sure, it's great fun to have a darkroom and play with silver gelatin prints for both color and B&#x26;W, but let's face it, we all have Instagram and want to share our work with the rest of the world. If you are lucky enough to have the film scanned at your local lab, great, but prices are <a href=\"https://silvergrainclassics.com/en/2021/10/film-prices-analysed/\">going higher and higher</a>, so to get those images on your device, you need some setup to scan them.</p>","content":"<p>In this day and age, if you are a film shooter, you know that digitalizing film is inevitable. Sure, it's great fun to have a darkroom and play with silver gelatin prints for both color and B&#x26;W, but let's face it, we all have Instagram and want to share our work with the rest of the world. If you are lucky enough to have the film scanned at your local lab, great, but prices are <a href=\"https://silvergrainclassics.com/en/2021/10/film-prices-analysed/\">going higher and higher</a>, so to get those images on your device, you need some setup to scan them.</p>\n<!-- read more -->\n<p>The cheapest one is to buy one of the flatbed scanners, like Epson V600, but for 35mm film, I did not get the results I wanted. Another option is to get a dedicated film scanner from Nikon, Minolta, and others, but people sell them for mental prices and are out of budget for me. So here comes the option of scanning with the digital camera.</p>\n<p>A few components of which setup consists are a <a href=\"#camera\"><strong>camera</strong></a>, a <a href=\"#lens\"><strong>lens</strong></a> with macro capability; some <a href=\"#stand\"><strong>stand</strong></a> to hold the camera, a <a href=\"#film_holder\"><strong>film holder</strong></a>, and a <a href=\"https://#light_source\"><strong>light source</strong></a>. let's break it down each by one</p>\n<h4>Camera</h4>\n<p>I use cropped sensor mirrorless Sony a6400, but you can use any camera with an interchangeable lens, whether it's DSLR or mirrorless, full-frame, or cropped sensor.</p>\n<h4>Lens</h4>\n<p>To me, this is the crucial part. Here we have a few options, but it needs to be a macro-capable one. One of the most popular options is to buy Nikkor 55 ⨐2.8 AI-S Micro, which is not very expensive and seems to be a good option, but I already own some enlargers and enlarger lenses. I chose the enlarger lens El-Nikkor ⨐ 2.8, a cheap lens that produces excellent images. The cool thing about the enlarger lenses is that it's built for projecting flat images and as our film is also flat, or at least it should be 🙃, this will be a good fit for us.</p>\n<p>To mount an enlarger lens on the camera, we need some adapters. The lens has an M39 Leica mount (as most the enlarger lenses do), and my camera (Sony a6400) has a Sony E-mount bayonet. You might think buying an M39 to Sony E-mount adapter would do the job, but wait for a second; we are not yet there. The lens does not have any mechanism to focus, so you need to physically change the distance to the subject and get closer or far from it to focus on it. An excellent tool for that is called a \"focusing helicoid adapter\" to make our life easier. You can find it for different mount types. Still, I find the M42-to-M42 version easiest and cheapest to bye. as it is an M42 mount and the lens has M39, I bought an M39 to M42 adapter wing, which is dirt cheap, and instead of M39 to Sony E adapter, I brought M42 to Sony E adapter. This whole information may sound intimidating, but it's not.</p>\n<blockquote>\n<p>Another cheap option for “easy focusing” and also for macro photography is to buy some kind of so-called 'Bellows,' which I'll explore later</p>\n</blockquote>\n<p>So these are the final lens mount system:</p>\n<ul>\n<li>Lens El-Nikkor f2.8</li>\n<li>M39 to M42 Adapter</li>\n<li>M42 to M42 focusing helicoid adapter</li>\n<li>M42 to Sony E mount adapter</li>\n</ul>\n<p class=\"flex flex-wrap justify-center\">\n  <img src=\"https://res.craft.do/user/full/c1f660f3-6119-a09b-30f1-aebf482da31b/doc/2F264CB5-8622-4E22-97A1-2DAB1ED64B38/E97EA553-6561-4516-AF95-7CA043074197_2/dxP6kLHWNXzDYghfy0j75yh7Q8odq7IRl3jqtgEvJDIz/373972_01_1000x1000.jpeg\" width=\"180\" alt=\"Lens El-Nikkor f2.8\">\n  <img src=\"https://res.craft.do/user/full/c1f660f3-6119-a09b-30f1-aebf482da31b/doc/2F264CB5-8622-4E22-97A1-2DAB1ED64B38/B2ADC36E-770D-42A2-B837-A780EA8F0B49_2/iTokux5ZDNhHeO1mht89RzQlOtlI3HVkhvkNVyaaRPkz/m39m42.jpeg\" width=\"180\" alt=\"M39 to M42 Adapter\"> \n  <img src=\"https://res.craft.do/user/full/c1f660f3-6119-a09b-30f1-aebf482da31b/doc/2F264CB5-8622-4E22-97A1-2DAB1ED64B38/44FDC1D6-8D81-4431-9D41-19A138F58647_2/x9zBk0O1SYiJ5LCzVAQNba6AK5d4YxvXrUUvpz1Zjqgz/M42-M42-MCR-01_1400x.jpeg\" width=\"180\" alt=\"M42 to M42 focusing helicoid adapter\">\n  <img src=\"https://res.craft.do/user/full/c1f660f3-6119-a09b-30f1-aebf482da31b/doc/2F264CB5-8622-4E22-97A1-2DAB1ED64B38/0F1E5C89-81DE-49B6-A5A4-7BD15378E8D7_2/yphvqiNCkhhnv6Zb9ToWXrqsPPFBq1j1hBDpcgPHx4Ez/m42nex.jpeg\" width=\"180\" alt=\"M42 to Sony E mount adapter\">\n</p>\n<h4>Stand</h4>\n<p>When it comes to stand, first what comes to mind is a tripod, which I already own. While it may be somewhat sturdy, legs always get in my way and never really is the comfortable way to use it. Also, we need to hold the camera pointing lens down towards the film, and if you don't already possess a perfect and flexible one, my suggestion would be: don't go that way.</p>\n<p>Other than a tripod, copy-stands seemed an excellent and reliable solution, but copy-stands from Kaiser or other brands can get expensive. So I decided to make one 😎. as I already wrote above, I happen to have a Durst enlarger which, with easy conversions, can be used as a copy-stand.</p>\n<p>If you choose to buy an enlarger as a copy stand, I recommend Durst M601, which I currently use; it has a 3/8\" screw hole, and you can easily mount a tripod ball-head on it.</p>\n<p>Another good and more compact alternative is Durst M301 or Durst F30, which sometimes goes cheap on eBay (for 20$).</p>\n<p><img src=\"https://res.craft.do/user/full/c1f660f3-6119-a09b-30f1-aebf482da31b/doc/2F264CB5-8622-4E22-97A1-2DAB1ED64B38/8D006530-E9D4-45BC-B435-2553D5023A09_2/z1EBaZ2oCxsQQpJrm3NYxMaesn4vRZLFkbJBh6zaZocz/Xnip2022-07-07_10-30-57.png\" alt=\"Durst M601\"></p>\n<h4>Film holder</h4>\n<p>If you have tried to search film holders, you are probably familiar with film holders from Valoi, Negative Supply, Essential Film holders, Lomography Digitalize, and others. Some of them look very neat, sturdy, and a reliable solution but are not particularly cheap. You can also make DIY it at home from cardboard. Alternatively, there are some 3D model files out there (you can google it), and if you have a 3D printer, you can print it or find the 3d print-shop online and order. I discovered my 3D-printed one on Etsy for 30€, it can only hold 35mm film, but that's enough for me. It's small and affordable, not super great, but usable, and it does its job. I may invest in the Valoi system in the future; let's see.</p>\n<p><img src=\"https://res.craft.do/user/full/c1f660f3-6119-a09b-30f1-aebf482da31b/doc/2F264CB5-8622-4E22-97A1-2DAB1ED64B38/BE47976C-05DA-4966-872E-C022FA63F2DF_2/kY7xT1j1y9rW3DIhrShRmTa9zQAvvlJeSkQIeoOnxYEz/il_1588xN.3852146595_wjbs.jpeg\" alt=\"35mm Film holder\"></p>\n<h4>Light Source</h4>\n<p>I've searched options for LED light-box to find out which options people are using, and there is a diversity of opinion about it. I just went to my local art supply store and bought a cheap A4 size light-box for tracing paper. You can also use an iPad or iPhone as a light source but try to diffuse it somehow to avoid \"screen pixels\" appearing on the final image.</p>\n<blockquote>\n<p>If you accounted newton rings with you light-box, it can be solved by using ARN glass (Anti-Newton).</p>\n</blockquote>\n<p>Tips for the lighting:</p>\n<ol>\n<li>Shoot with the emulsive (matte) side of the film facing your camera (it's less reflective)</li>\n<li>Use your lens hood (if you have one)</li>\n<li>Turn off all ambient lights in the room</li>\n<li>Have your aperture on your lens set to around f8.0</li>\n</ol>\n<p>See more tips about the backlight source: <a href=\"https://forums.negativelabpro.com/t/suggested-backlight-sources-for-scanning-film-with-dslr/130\">https://forums.negativelabpro.com/t/suggested-backlight-sources-for-scanning-film-with-dslr/130</a></p>\n<p><strong>TL, DR;</strong></p>\n<p>Here is a picture of my setup; it looks sturdy, feels sturdy, and works great.</p>\n<p>Can this be improved? This is a good one, but I can take it further. I already have some ideas to take this scanning setup to the next level using Arduino: to roll the film and automatically take pictures. Also, maybe using an enlarger head as a better-diffused light source in the future, but this scanning setup seems quite enough for me to test the camera scanning experience.</p>\n<p><img src=\"/content/scanning-film-with-a-digital-camera/scan_1.jpeg\" alt=\"IMG_4969.jpeg\"></p>\n<p><img src=\"/content/scanning-film-with-a-digital-camera/scan_2.jpeg\" alt=\"IMG_4971.jpeg\"></p>\n<p><img src=\"/content/scanning-film-with-a-digital-camera/scan_3.jpeg\" alt=\"IMG_4973.jpeg\"></p>\n<p><img src=\"/content/scanning-film-with-a-digital-camera/scan_4.jpeg\" alt=\"IMG_4970.jpeg\"></p>"},{"slug":"starting-digital-garden","title":"Starting digital garden","date":"2022-06-15T16:30:17.316Z","cover":"/content/starting-digital-garden/starting-digital-garden.jpg","metaImage":null,"excerpt":"<p>We all have some topic we'd like to discuss publicly or express our thoughts. We get down with our laptops and start writing a “blog,” but then something comes up, and we rethink, strive to perfect every aspect, and create drafts instead of publishing. Yes, from time to time, we might feel guilty about drafts hanging there and waiting to be published, but what can we do about it? Nothing 🤷‍♂️ it's not yet ready for publishing. What will the readers say if I post them \"unfinished\"? And the drafts section continues to grow...</p>","content":"<p>We all have some topic we'd like to discuss publicly or express our thoughts. We get down with our laptops and start writing a “blog,” but then something comes up, and we rethink, strive to perfect every aspect, and create drafts instead of publishing. Yes, from time to time, we might feel guilty about drafts hanging there and waiting to be published, but what can we do about it? Nothing 🤷‍♂️ it's not yet ready for publishing. What will the readers say if I post them \"unfinished\"? And the drafts section continues to grow...</p>\n<!-- read more -->\n<p>This is what makes me sick of the blogging idea, and I decided to try “digital gardening” instead. Here I can do whatever I want, whenever I want, just as if this was my physical garden. This space, this garden, is all mine. I will try some ideas and write notes about things I like, stuff I explore, and what interests me, regardless of the hobbies I have. Mostly this will touch on programming, books, art, and photography, but these are not the constraints I can't fence; I will share thoughts and notes about anything. This does not preclude me from polishing articles as much as I desire 😎. Remember, this is my garden built for me. As <a href=\"https://joelhooks.com\">Joel Hook</a> said:</p>\n<blockquote>\n<p>It's my garden, but I'm happy for you to hang around and eat tomatos with me.</p>\n</blockquote>\n<p>The whole point of gardening to me is that you can write down ideas you are thinking of and give it the written form of life, which is a big deal, let the others provide you with feedback and thoughts about it, and take it to the next level, develop it.</p>\n<p>Of course, there are things to be put in order, but it will be fun to do some gardening in the evening on my iPad in the cafes or the park 👨‍🌾</p>"},{"slug":"dark-matter","title":"Multiverse – Dark Matter","date":"2019-05-19T16:30:17.316Z","cover":null,"metaImage":"https://pbs.twimg.com/media/FODxClmVcAYi5wi?format=jpg&name=small","excerpt":"<h4>\"Are you happy with your life?\"</h4>\n<p>A question that has come to many of us and puzzled us. Are you happy with your life? What would your life be like at different times and moments in the past to make other opposite choices? We may not understand this anymore, but imagine a life where your best or worst version lives the life you could have had. Who knows, maybe you will not have such a bad life as you think.</p>","content":"<h4>\"Are you happy with your life?\"</h4>\n<p>A question that has come to many of us and puzzled us. Are you happy with your life? What would your life be like at different times and moments in the past to make other opposite choices? We may not understand this anymore, but imagine a life where your best or worst version lives the life you could have had. Who knows, maybe you will not have such a bad life as you think.</p>\n<!-- read more -->\n<p>In this exciting book, Blake Crouch offers a multi-world where our lives are torn apart by the decisions we make. I discovered the book by accident and liked it very much. Recommend that you read Sci-fi lovers. I will be honest and tell fyou that this book and in general Blake's books reminded me of my all-time favorite science fiction writer, Philip Dick, and never read books more similar before in terms of style. I think Philip Dick fans will like it.</p>\n<p>The impressions of the book followed me for a good long time. I was looking for books like this and I stumbled upon one of those book fans on Reddit whose story made me happy.</p>\n<p align=\"center\">\n  <img src=\"https://zolianipanda.files.wordpress.com/2019/05/cleanshot-2019-05-09-at-13.55.19402x.png?w=663&#x26;h=203&#x26;zoom=2\">\n  <em>Post on Reddit</em>\n</p>\n<p>After reading the book, I read other ones by the author as well, and The Wayward Pines Trilogy also turned out to be catchy and interesting. A TV series of the same name is based on this story.</p>\n<p>Despite my admiration for this book on Reddit, readers' opinions were quite divided. I have found people like me who admire this book. A few of my friends also read this book and were satisfied.</p>\n<p>You can also check out the author's AMA (Ask Me Anything) Blake Crouch AMA On Reddit, where Blake himself answers readers' questions about his books.</p>\n<p align=\"center\">\n  <img class=\"rounded-md\" src=\"https://pbs.twimg.com/media/FODxClmVcAYi5wi?format=jpg&#x26;name=small\">\n  <em>Interior for Dark Matter - illustration by <a href=\"https://twitter.com/blakecrouch1/status/1504477293002981381\" target=\"_blank\">Hilary Clarcq</a></em>\n</p>\n<p>In 2014, before dark matter saw the light of day, Sony Pictures acquired the rights to make the film, although the fate of the book's film adaptation is still unknown. There was also the idea to shoot a TV series instead of a movie. The series can be exciting when Jason moves to different worlds and visits alternate worlds.</p>\n<p>On June 11th we will see another book by Blake Crouch - Recursion, which I am sure will be just as entertaining and interesting as \"Dark Matter\"</p>\n<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/73799584&#x26;color=%23ff5500&#x26;auto_play=true&#x26;hide_related=false&#x26;show_comments=true&#x26;show_user=true&#x26;show_reposts=false&#x26;show_teaser=true&#x26;visual=true\"></iframe>"},{"slug":"how-photography-improves-us","title":"How photography improves individually","date":"2018-01-27T16:30:17.316Z","cover":null,"metaImage":null,"excerpt":"<h4>How does photography change a person?</h4>\n<p>Photography is a method of communication that helps us perceive the world that the photographer offers us, to recall a moment from our lives. One can talk about many positive aspects of photography. This is to see the world that you can not reach. Photography - as a hobby, helps you to overcome various personal life crises, helps you to have a goal, and just look at the world from a positive side.</p>","content":"<h4>How does photography change a person?</h4>\n<p>Photography is a method of communication that helps us perceive the world that the photographer offers us, to recall a moment from our lives. One can talk about many positive aspects of photography. This is to see the world that you can not reach. Photography - as a hobby, helps you to overcome various personal life crises, helps you to have a goal, and just look at the world from a positive side.</p>\n<!-- read more -->\n<p>When there are not good days in life, when you run down and everything gets complicated, it's just better to take a camera and look at reality through the lens, get away from the ordinary everyday life. I went out to shoot. At such times you can not and do not think about problems, you forget that something is bothering you and will not let you down, you are just full of enthusiasm and you want to catch more and more shots. You do not think about time, you do not think about the place, you go and in anticipation of something interesting your face fills with a childish smile again when you look with a completely different eye at something you have not noticed before even though you saw it every day. When you return home, you will quickly look at the pictures taken and if at least 1-2 are \"The photo\",</p>\n<blockquote>\n<p>There are many more things, between heaven and earth, than are dreamt of in your philosophy, Horatio.<br>\n—Shakespeare, <em>Hamlet</em></p>\n</blockquote>\n<p>I even decided to do some research on visual arts and health and how Art Therapy affects general health. The article cites an example of a study of a group of people undergoing chemotherapy. Some of them were busy with art, some were not. It turned out that those who were associated with any kind of art (music, sculpture, photography, etc.) were in a much less stressful state and more positive despite their difficult situation. I will not start by reviewing the full article, you can see it on the website of the American National Center for Biotechnology -  <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2804629/\">The Connection Between Art, Healing, and Public Health</a></p>\n<p>It is not necessary to turn everything upside down to have more contact with art. It is often the case that as a child you learn to play, draw, sculpt, and then grow up and everything is left behind, and you wonder what it would be like if you'd had followed it, what life would be like, never say never, it is not too late. Do you like it? Do you want? Just try it!</p>"}]},"__N_SSG":true}