{"pageProps":{"notes":[{"slug":"starting-digital-garden","title":"Starting digital garden","date":"2022-06-15T16:30:17.316Z","cover":"/content/starting-digital-garden/starting-digital-garden.jpg","excerpt":"<p>We all have some topic we'd like to discuss publicly or express our thoughts. We get down with our laptops and start writing a “blog,” but then something comes up, and we rethink, strive to perfect every aspect, and create drafts instead of publishing. Yes, from time to time, we might feel guilty about drafts hanging there and waiting to be published, but what can we do about it? Nothing 🤷‍♂️ it's not yet ready for publishing. What will the readers say if I post them \"unfinished\"? And the drafts section continues to grow...</p>","content":"<p>We all have some topic we'd like to discuss publicly or express our thoughts. We get down with our laptops and start writing a “blog,” but then something comes up, and we rethink, strive to perfect every aspect, and create drafts instead of publishing. Yes, from time to time, we might feel guilty about drafts hanging there and waiting to be published, but what can we do about it? Nothing 🤷‍♂️ it's not yet ready for publishing. What will the readers say if I post them \"unfinished\"? And the drafts section continues to grow...</p>\n<!-- read more -->\n<p>This is what makes me sick of the blogging idea, and I decided to try “digital gardening” instead. Here I can do whatever I want, whenever I want, just as if this was my physical garden. This space, this garden, is all mine. I will try some ideas and write notes about things I like, stuff I explore, and what interests me, regardless of the hobbies I have. Mostly this will touch on programming, books, art, and photography, but these are not the constraints I can't fence; I will share thoughts and notes about anything. This does not preclude me from polishing articles as much as I desire 😎. Remember, this is my garden built for me. As <a href=\"https://joelhooks.com\">Joel Hook</a> said:</p>\n<blockquote>\n<p>It's my garden, but I'm happy for you to hang around and eat tomatos with me.</p>\n</blockquote>\n<p>The whole point of gardening to me is that you can write down ideas you are thinking of and give it the written form of life, which is a big deal, let the others provide you with feedback and thoughts about it, and take it to the next level, develop it.</p>\n<p>Of course, there are things to be put in order, but it will be fun to do some gardening in the evening on my iPad in the cafes or the park 👨‍🌾</p>"},{"slug":"dark-matter","title":"Multiverse – Dark Matter","date":"2019-05-19T16:30:17.316Z","cover":null,"excerpt":"<h4>\"Are you happy with your life?\"</h4>\n<p>A question that has come to many of us and puzzled us. Are you happy with your life? What would your life be like at different times and moments in the past to make other opposite choices? We may not understand this anymore, but imagine a life where your best or worst version lives the life you could have had. Who knows, maybe you will not have such a bad life as you think.</p>","content":"<h4>\"Are you happy with your life?\"</h4>\n<p>A question that has come to many of us and puzzled us. Are you happy with your life? What would your life be like at different times and moments in the past to make other opposite choices? We may not understand this anymore, but imagine a life where your best or worst version lives the life you could have had. Who knows, maybe you will not have such a bad life as you think.</p>\n<!-- read more -->\n<p>In this exciting book, Blake Crouch offers a multi-world where our lives are torn apart by the decisions we make. I discovered the book by accident and liked it very much. Recommend that you read Sci-fi lovers. I will be honest and tell fyou that this book and in general Blake's books reminded me of my all-time favorite science fiction writer, Philip Dick, and never read books more similar before in terms of style. I think Philip Dick fans will like it.</p>\n<p>The impressions of the book followed me for a good long time. I was looking for books like this and I stumbled upon one of those book fans on Reddit whose story made me happy.</p>\n<p align=\"center\">\n  <img src=\"https://zolianipanda.files.wordpress.com/2019/05/cleanshot-2019-05-09-at-13.55.19402x.png?w=663&#x26;h=203&#x26;zoom=2\">\n  <em>Post on Reddit</em>\n</p>\n<p>After reading the book, I read other ones by the author as well, and The Wayward Pines Trilogy also turned out to be catchy and interesting. A TV series of the same name is based on this story.</p>\n<p>Despite my admiration for this book on Reddit, readers' opinions were quite divided. I have found people like me who admire this book. A few of my friends also read this book and were satisfied.</p>\n<p>You can also check out the author's AMA (Ask Me Anything) Blake Crouch AMA On Reddit, where Blake himself answers readers' questions about his books.</p>\n<p align=\"center\">\n  <img class=\"rounded-md\" src=\"https://pbs.twimg.com/media/FODxClmVcAYi5wi?format=jpg&#x26;name=small\">\n  <em>Interior for Dark Matter - illustration by <a href=\"https://twitter.com/blakecrouch1/status/1504477293002981381\" target=\"_blank\">Hilary Clarcq</a></em>\n</p>\n<p>In 2014, before dark matter saw the light of day, Sony Pictures acquired the rights to make the film, although the fate of the book's film adaptation is still unknown. There was also the idea to shoot a TV series instead of a movie. The series can be exciting when Jason moves to different worlds and visits alternate worlds.</p>\n<p>On June 11th we will see another book by Blake Crouch - Recursion, which I am sure will be just as entertaining and interesting as \"Dark Matter\"</p>\n<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/73799584&#x26;color=%23ff5500&#x26;auto_play=true&#x26;hide_related=false&#x26;show_comments=true&#x26;show_user=true&#x26;show_reposts=false&#x26;show_teaser=true&#x26;visual=true\"></iframe>"},{"slug":"how-photography-improves-us","title":"How photography improves individually","date":"2018-01-27T16:30:17.316Z","cover":null,"excerpt":"<h4>How does photography change a person?</h4>\n<p>Photography is a method of communication that helps us perceive the world that the photographer offers us, to recall a moment from our lives. One can talk about many positive aspects of photography. This is to see the world that you can not reach. Photography - as a hobby, helps you to overcome various personal life crises, helps you to have a goal, and just look at the world from a positive side.</p>","content":"<h4>How does photography change a person?</h4>\n<p>Photography is a method of communication that helps us perceive the world that the photographer offers us, to recall a moment from our lives. One can talk about many positive aspects of photography. This is to see the world that you can not reach. Photography - as a hobby, helps you to overcome various personal life crises, helps you to have a goal, and just look at the world from a positive side.</p>\n<!-- read more -->\n<p>When there are not good days in life, when you run down and everything gets complicated, it's just better to take a camera and look at reality through the lens, get away from the ordinary everyday life. I went out to shoot. At such times you can not and do not think about problems, you forget that something is bothering you and will not let you down, you are just full of enthusiasm and you want to catch more and more shots. You do not think about time, you do not think about the place, you go and in anticipation of something interesting your face fills with a childish smile again when you look with a completely different eye at something you have not noticed before even though you saw it every day. When you return home, you will quickly look at the pictures taken and if at least 1-2 are \"The photo\",</p>\n<blockquote>\n<p>There are many more things, between heaven and earth, than are dreamt of in your philosophy, Horatio.<br>\n—Shakespeare, <em>Hamlet</em></p>\n</blockquote>\n<p>I even decided to do some research on visual arts and health and how Art Therapy affects general health. The article cites an example of a study of a group of people undergoing chemotherapy. Some of them were busy with art, some were not. It turned out that those who were associated with any kind of art (music, sculpture, photography, etc.) were in a much less stressful state and more positive despite their difficult situation. I will not start by reviewing the full article, you can see it on the website of the American National Center for Biotechnology -  <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2804629/\">The Connection Between Art, Healing, and Public Health</a></p>\n<p>It is not necessary to turn everything upside down to have more contact with art. It is often the case that as a child you learn to play, draw, sculpt, and then grow up and everything is left behind, and you wonder what it would be like if you'd had followed it, what life would be like, never say never, it is not too late. Do you like it? Do you want? Just try it!</p>"}]},"__N_SSG":true}