{"pageProps":{"article":{"title":"MERN monorepo boilerplate","date":"2018-01-14T23:11:04.831Z","cover":null,"excerpt":"<p>Hello reader,\nI want to talk about monorepo, and also will share boilerplate for MERN (Mongo, Express.js, React, React-Native/Expo) stack.</p>\n<p>When it comes to a real-life project, it consists of multiple services fronted, backend/API and mobile. We can split them into separate repositories, but sharing code between repositories is difficult when using multiple repositories. This is the moment where monorepo shines.</p>","content":"<p>Hello reader,\nI want to talk about monorepo, and also will share boilerplate for MERN (Mongo, Express.js, React, React-Native/Expo) stack.</p>\n<p>When it comes to a real-life project, it consists of multiple services fronted, backend/API and mobile. We can split them into separate repositories, but sharing code between repositories is difficult when using multiple repositories. This is the moment where monorepo shines.</p>\n<!-- read more -->\n<p>Let's compare monorepo to mutli-repo style.</p>\n<h4>Monorepo</h4>\n<p>Monorepo is split into many single-repos. Each single-repo repository is read-only. You can change its code via pull-request to the monorepo.</p>\n<h4>Multirepo</h4>\n<p>The other approach is to manage multiple repositories. 1 package = 1 own repository. Each package has its own development, tagging, and even maintainers.</p>\n<h4>Monolith</h4>\n<p>Monolith IS NOT monorepo. Monolith is a huge amount of coupled code of one application that is hell to maintain.</p>\n<p>This is what monorepo repository looks like</p>\n<p align=\"center\">\n  <img src=\"https://cdn-images-1.medium.com/max/1600/1*95IEDUCN3mfU9vpTWXChhQ@2x.png\" style=\"height:600px\">\n</p>\n<h2>Boilerplate</h2>\n<h5>Lerna</h5>\n<blockquote>\n<p>Lerna is a tool that optimizes the workflow around managing multi-package repositories with git and npm.</p>\n</blockquote>\n<p>Lerna tries to ease the management of npm links when dealing with multi-package projects hosted in a single repository. It analyzes the packages and automatically creates the required npm links between them. It also handles the execution of tasks across multiple packages and eases the pain of versioning and publishing.\nIt has its shortcomings but it’s worth using it. Big projects like Babel and Jest use Lerna.</p>\n<h5>Yarn workspaces</h5>\n<blockquote>\n<p>Workspaces are a new way to setup your package architecture (..) It allows you to setup multiple packages in such a way that you only need to run yarn install once to install all of them in a single pass.</p>\n</blockquote>\n<p>Your dependencies can be linked together, which means that your workspaces can depend on one another while always using the most up-to-date code available. This is also a better mechanism than yarn link since it only affects your workspace tree rather than your whole system.</p>\n<h5>Eslint / Tslint / Stylelint / Prettier</h5>\n<p>In this boilerplate eslint, tslint, stylelint and prettier are already isntalled, configured and ready to go!</p>\n<h5>Husky / Lint-staged / Commit lint</h5>\n<blockquote>\n<p>Husky - Git hooks made easy</p>\n</blockquote>\n<p>Husky is a tool which gives us the ability to catch GIT hooks like commit and/or push</p>\n<blockquote>\n<p>Lint-staged - Run linters against staged git files and don't let 💩 slip into your code base!</p>\n</blockquote>\n<p>Lint-staged is a nice tool to run linters (for example: eslint) on staged files to prevent commit code which is note linter compatible</p>\n<blockquote>\n<p>Conventional (Semantic) Commit Messages - is a lightweight convention on top of commit messages. It provides an easy set of rules for creating an explicit commit history;</p>\n</blockquote>\n<p>Conventional or Semantic commit messages is naming convension, that helps us to easily determine what commit contains and also it's very helpful to avoid multiple fixes in a single commit.</p>\n<p>If you are not familiar with conventional commits, here are some links with detailed info</p>\n<p><a href=\"https://www.conventionalcommits.org/en/v1.0.0-beta.4/\">Conventional Commits</a>\n<a href=\"https://seesparkbox.com/foundry/semantic_commit_messages\">Semantic Commits</a></p>\n<h3>How to start</h3>\n<p>All you need is to clone <a href=\"https://github.com/shakogegia/mern-monorepo-boilerplate\">repository</a>, run <code>yarn</code> to install dependencies and you can start the project by running <code>yarn dev</code></p>\n<p><img src=\"https://thepracticaldev.s3.amazonaws.com/i/7y04oyepefran5du6nv1.png\" alt=\"Alt Text\"></p>\n<p>Packages structure:</p>\n<ul>\n<li>client - React app created via<code>create-react-app</code></li>\n<li>api - Node.js / Express.js</li>\n<li>socket - Socket.io server</li>\n<li>mobile - React-native/Expo project</li>\n<li>common - common utility functions shared accross all package</li>\n<li>constants - just a container for constant variables also shared accross all package</li>\n</ul>\n<p>By running <code>yarn dev</code> from the root folder, lerna.js will execute <code>yarn dev</code> in every and each package</p>\n<p>Here are some of helpful lerna.js commands</p>\n<pre><code>npx lerna add &#x3C;package>\n</code></pre>\n<p>this will add <package> as a dependency to all packages</package></p>\n<pre><code>npx lerna add &#x3C;package1> --scope=&#x3C;package2>\n</code></pre>\n<p>this will add <package1> as a dependency to only package2</package1></p>\n<pre><code>npx lerna publish\n</code></pre>\n<p>this will increase version of all packages and also will generate CHANGELOG.md files for all packages and also for a root repository, based on conventional commits. (see picture below)\n<img src=\"https://thepracticaldev.s3.amazonaws.com/i/lwbsakys9rsbqbfp1mzq.png\" alt=\"Alt Text\"></p>\n<pre><code>npx lerna bootstrap\n</code></pre>\n<p>Installs all of the package dependencies in all packages and links any cross-dependencies.</p>\n<p>You can find more commands on Lerna.js's documentation</p>\n<p>Here is a boilerplate link:</p>\n<p><a href=\"https://github.com/shakogegia/mern-monorepo-boilerplate\">Github Repository</a></p>"}},"__N_SSG":true}